pmo-dataset/variations/graphviz_with_ids/39.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Select type of\nhardware Issue"];
  "User_2" [label="Select device model"];
  "User_3" [label="Write review"];
  "User_4" [label="Upload video of\nreparation steps"];
  "User_5" [label="Get second-hand\ntools and materials\nfrom friends"];
  "User_6" [label="purchase online"];
  "User_7" [label="Log into account"];
  "User_8" [label="Create account"];
  "User_9" [label="Contact friends"];
  "Service_1" [label="List required\nmaterials"];
  "Service_2" [label="List required tools"];
  "Service_3" [label="Offer ordering\nchoices"];
  "Service_4" [label="Display repair\ninstructions"];
  "Manual_1" [label="Repair device"];
  "Manual_2" [label="Send device to an\nexpert"];
  "StartNoneEvent_1" [shape=circle, label="Hardware issue\ndetected"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Hardware issue fixed"];
  "ExclusiveGateway_1" [shape=diamond, label="Is issue fixed?"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="Have all required\nitems?"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="Have intention to\nwrite a review?"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="Have intention to\nupload a video of\nrepair steps?"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="Have an account?"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ExclusiveGateway_11" [shape=diamond, label="Is login Successful?"];
  "ExclusiveGateway_12" [shape=diamond, label="X"];
  "ExclusiveGateway_13" [shape=diamond, label="Have intention to\nget second-hand\nitems?"];
  "ExclusiveGateway_14" [shape=diamond, label="X"];
  "ExclusiveGateway_15" [shape=diamond, label="Have intention to\npurchase new items?"];
  "ExclusiveGateway_16" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "ParallelGateway_1" -> "Service_1";
  "ParallelGateway_1" -> "Service_2";
  "ParallelGateway_1" -> "Service_3";
  "Service_1" -> "ParallelGateway_2";
  "Service_2" -> "ParallelGateway_2";
  "Service_3" -> "ParallelGateway_2";
  "User_2" -> "User_1";
  "User_1" -> "ParallelGateway_1";
  "Service_4" -> "Manual_1";
  "Manual_1" -> "ExclusiveGateway_1";
  "Manual_2" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
  "ExclusiveGateway_4" -> "Service_4";
  "User_3" -> "ExclusiveGateway_6";
  "ExclusiveGateway_6" -> "ExclusiveGateway_7";
  "User_4" -> "ExclusiveGateway_8";
  "ExclusiveGateway_7" -> "ExclusiveGateway_8" [label="No"];
  "ExclusiveGateway_7" -> "User_4" [label="Yes"];
  "ExclusiveGateway_5" -> "User_3" [label="Yes"];
  "ExclusiveGateway_5" -> "ExclusiveGateway_6" [label="No"];
  "ExclusiveGateway_8" -> "ExclusiveGateway_2";
  "ExclusiveGateway_10" -> "User_7";
  "User_7" -> "ExclusiveGateway_11";
  "ExclusiveGateway_11" -> "User_2" [label="Yes"];
  "ExclusiveGateway_11" -> "ExclusiveGateway_10" [label="No"];
  "ExclusiveGateway_12" -> "ExclusiveGateway_10";
  "User_5" -> "ExclusiveGateway_14";
  "ExclusiveGateway_15" -> "User_6" [label="Yes"];
  "User_6" -> "ExclusiveGateway_16";
  "ExclusiveGateway_13" -> "ExclusiveGateway_14" [label="No"];
  "ExclusiveGateway_15" -> "ExclusiveGateway_16" [label="No"];
  "User_8" -> "ExclusiveGateway_12";
  "StartNoneEvent_1" -> "ExclusiveGateway_9";
  "ExclusiveGateway_9" -> "User_8" [label="No"];
  "ExclusiveGateway_9" -> "ExclusiveGateway_12" [label="Yes"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_13" [label="No"];
  "ExclusiveGateway_16" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "Manual_2" [label="No"];
  "ExclusiveGateway_1" -> "ExclusiveGateway_5" [label="Yes"];
  "ExclusiveGateway_13" -> "User_9" [label="Yes"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_4" [label="Yes"];
  "User_9" -> "User_5";
  "ExclusiveGateway_14" -> "ExclusiveGateway_15";
  "ParallelGateway_2" -> "ExclusiveGateway_3";
}
